project-chip/connectedhomeip/examples/all-clusters-app/esp32/sdkconfig.defaults.esp32h21.tc
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32h21"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_RMT_SUPPRESS_DEPRECATE_WARN=y
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_ECJPAKE_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_JOINER=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_CHIP_SHELL=y
CONFIG_MAX_GROUP_ENDPOINTS_PER_FABRIC=3
CONFIG_ENABLE_OTA_REQUESTOR=y
CONFIG_ENABLE_EXTENDED_DISCOVERY=y
CONFIG_ENABLE_CONCURRENT_CONNECTION=n
CONFIG_DEVICE_PRODUCT_ID=0x8001
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_CHIPOBLE=n
CONFIG_CHIP_DEVICE_ENABLE_THREAD_MESHCOP=y
CONFIG_RENDEZVOUS_MODE_THREAD_MESHCOP=y
